{
  "backend/main.mo": "Main Motoko backend actor implementing user profiles, credit management, tool usage tracking, favorites, search history, preferences, and tool/category management with authorization and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence documentation features covering static pages, dynamic pages, and technology stack with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files including blog, forum, legal pages, tool components, utilities, hooks, and routing configuration with TanStack Router.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system defining CSS variables for light/dark themes including background, foreground, primary, secondary, muted, accent, destructive, border, and sidebar colors.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Worldsathi.com Tools Portal application.",
  "frontend/index.ts": "Code snippet showing related tools filtering pattern and ToolPageTemplate usage with tool, gradient, FAQs, and related tools props.",
  "frontend/README.md": "Project README describing Worldsathi.com as a 125+ tool portal built on Internet Computer with React/Motoko, listing features, prerequisites, and installation instructions.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with lazy-loaded routes for home, categories, dashboard, legal pages, admin panel, documentation (11 routes), and tool pages with QueryClient provider.",
  "frontend/src/components/AboutTheTool.tsx": "Reusable component displaying tool information in a card with sections for introduction, key features, who benefits, and why choose this tool, each with appropriate icons.",
  "frontend/src/components/AdminAuthGuard.tsx": "Authentication guard component that redirects to admin login if user is not authenticated, protecting admin routes.",
  "frontend/src/components/ApiAccessSection.tsx": "Displays API access information for a tool, including availability badge, description, code example in a syntax-highlighted block, and a link to documentation.",
  "frontend/src/components/Breadcrumbs.tsx": "Renders a breadcrumb navigation component with a home icon and clickable/non-clickable items based on whether they have paths.",
  "frontend/src/components/Button.tsx": "Defines a reusable Button component with variants (primary, secondary, ghost) and sizes using class-variance-authority for styling.",
  "frontend/src/components/CategoryBadge.tsx": "Displays a category badge with icon and optional subcategory, fetching category data by ID from constants.",
  "frontend/src/components/CategoryCards.tsx": "Renders a grid of category cards showing all tool categories with icons, descriptions, and tool counts, linking to category pages.",
  "frontend/src/components/CategoryFilters.tsx": "Provides sorting dropdown and active filter display with clear functionality for category/tool filtering.",
  "frontend/src/components/CategoryHero.tsx": "Displays a hero banner for a category page with gradient background image, category icon, name, and description.",
  "frontend/src/components/dashboard/Analytics.tsx": "Empty file for dashboard analytics component.",
  "frontend/src/components/dashboard/ApiKeyManagement.tsx": "Empty file for API key management component.",
  "frontend/src/components/dashboard/SavedTools.tsx": "Empty file for saved tools dashboard component.",
  "frontend/src/components/dashboard/UsageHistory.tsx": "Empty file for usage history component.",
  "frontend/src/components/docs/PdfDownloadButton.tsx": "Styled download button for the complete IC developer guide PDF with gradient background and download icon.",
  "frontend/src/components/DynamicIcon.tsx": "Dynamically renders Lucide icons by string name with fallback to Wrench icon if the specified icon is not found.",
  "frontend/src/components/FeaturedBlogCards.tsx": "Empty file placeholder for featured blog cards component.",
  "frontend/src/components/FeaturedToolsGrid.tsx": "Displays a grid of the first 6 featured tools with cards showing icons, names, descriptions, and 'Popular' badges.",
  "frontend/src/components/FeaturedToolsSection.tsx": "Renders a section of featured tools (up to 6) with star badges and hover effects, accepting tools array and optional title.",
  "frontend/src/components/gamification/BadgeDisplay.tsx": "Empty file for badge display component.",
  "frontend/src/components/gamification/BadgeUnlockedNotification.tsx": "Empty file for badge unlock notification component.",
  "frontend/src/components/gamification/StreakCounter.tsx": "Empty file for streak counter component.",
  "frontend/src/components/HeroSection.tsx": "Homepage hero section with background image, headline, CTA buttons, and statistics grid showing tool count and availability.",
  "frontend/src/components/KeyboardShortcutsHelp.tsx": "Empty file placeholder for keyboard shortcuts help component.",
  "frontend/src/components/layout/Footer.tsx": "Site footer with brand info, social media links, quick navigation, contact details, and legal links in a responsive grid layout.",
  "frontend/src/components/layout/Header.tsx": "Main navigation header component with responsive mobile menu, authentication controls via Internet Identity, category dropdown, and theme switcher. Includes links to home, dashboard, docs, about, and contact pages.",
  "frontend/src/components/layout/Layout.tsx": "Root layout wrapper component that combines Header, Footer, main content area, and ScrollToTop functionality into a flex column structure.",
  "frontend/src/components/layout/ThemeSwitcher.tsx": "Theme toggle button component using next-themes that switches between light and dark modes with animated sun/moon icons.",
  "frontend/src/components/NewToolsSection.tsx": "Displays up to 8 newly added tools in a grid with 'NEW' badges, icons, descriptions, category badges, and 'Open Tool' buttons.",
  "frontend/src/components/onboarding/OnboardingTour.tsx": "Empty file placeholder for onboarding tour functionality.",
  "frontend/src/components/PerformanceMetrics.tsx": "Displays a grid of performance metric cards with icons, values, labels, and optional descriptions. Maps icon names to Lucide icon components.",
  "frontend/src/components/PopularToolsByCategory.tsx": "Shows popular tools grouped by category with up to 4 tools per category and a 'View All' link if more exist. Renders tool cards in a responsive grid.",
  "frontend/src/components/ScrollToTop.tsx": "Floating button that appears after scrolling 300px down and smoothly scrolls the page back to top when clicked.",
  "frontend/src/components/Sidebar.tsx": "Sticky sidebar container that displays trending tools, category shortcuts, and recent blog posts with scrollable overflow.",
  "frontend/src/components/sidebar/QuickCategoryShortcuts.tsx": "Sidebar card component displaying a list of tool categories with icons as quick navigation shortcuts.",
  "frontend/src/components/sidebar/RecentBlogPosts.tsx": "Sidebar card showing three mock recent blog posts with thumbnails and titles; placeholder for future blog implementation.",
  "frontend/src/components/sidebar/TrendingTools.tsx": "Sidebar card displaying the top 5 trending tools with icons, names, and ranking numbers as clickable links.",
  "frontend/src/components/TestimonialsSection.tsx": "Displays user testimonials in a two-column grid with quotes, author info, roles, and optional star ratings.",
  "frontend/src/components/ToolCard.tsx": "Clickable card component for displaying tool metadata with icon, name, description, and optional 'NEW' badge. Includes hover effects.",
  "frontend/src/components/ToolGrid.tsx": "Filterable and sortable grid of tool cards with search, category filters, and sort options. Handles tool filtering and display logic.",
  "frontend/src/components/ToolHero.tsx": "Hero banner component displaying tool name and category badge over a gradient background image with overlay.",
  "frontend/src/components/ToolIntroduction.tsx": "Card component displaying an introductory description for a tool with an info icon and styled border.",
  "frontend/src/components/TrustSignals.tsx": "Displays three trust metrics (active users, tools count, growth status) in a centered grid with icons and hover effects.",
  "frontend/src/components/UsabilityGuide.tsx": "Numbered step-by-step guide card showing how to use a tool with circular numbered badges and descriptive text.",
  "frontend/src/constants/categories.ts": "Defines 16 tool categories with metadata including IDs, display names, Lucide icons, and descriptions. Provides helper functions to retrieve category information by ID.",
  "frontend/src/constants/tools.ts": "Comprehensive tool metadata definitions for 57 tools across all categories, including detailed information like descriptions, paths, tags, usability steps, about content, and FAQs. Currently shows percentage and BMI calculator definitions.",
  "frontend/src/contexts/AdminAuthContext.tsx": "React context provider for admin authentication state, wrapping the useAdminAuth hook and exposing login, logout, and authentication status to child components.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages backend actor instances based on Internet Identity authentication state, handling both authenticated and anonymous actors with query invalidation on identity changes.",
  "frontend/src/hooks/useAdminAuth.ts": "Admin authentication hook with hardcoded credentials, managing login/logout state in localStorage and providing authentication status for admin panel access.",
  "frontend/src/hooks/useCredits.ts": "Provides React Query hooks for managing user credits including fetching balances, consuming credits, listing all balances, and updating profile credits with automatic query invalidation.",
  "frontend/src/hooks/useGamification.ts": "Empty file placeholder for gamification-related hooks.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider with login/logout functionality, identity management, and status tracking using DFINITY's AuthClient.",
  "frontend/src/hooks/useKeyboardShortcuts.ts": "Empty file placeholder for keyboard shortcuts functionality.",
  "frontend/src/hooks/useOnboarding.ts": "Manages onboarding flow state with localStorage persistence, providing step navigation and completion tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for user profiles, favorites, preferences, tool usage tracking, and search history with automatic cache invalidation.",
  "frontend/src/hooks/useUsageLimits.ts": "Implements daily usage limits per tool (10 uses) with localStorage tracking, automatic reset at midnight, and remaining usage count management.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with OKLCH color system for light/dark themes, custom scrollbar styles, and dropdown component styling fixes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider wrapping the main App component.",
  "frontend/src/pages/AboutArchitecture.tsx": "Empty file placeholder for architecture documentation page.",
  "frontend/src/pages/AboutUs.tsx": "Renders the About Us page with hero section, mission/values/community/commitment cards, and company information using shadcn/ui components.",
  "frontend/src/pages/admin/BlogManagement.tsx": "Admin page for blog management wrapped in AdminAuthGuard, currently showing a placeholder 'Coming Soon' message.",
  "frontend/src/pages/admin/CreditManagement.tsx": "Admin page for viewing and managing user credit balances with sortable table, summary cards, and refresh functionality. Protected by AdminAuthGuard.",
  "frontend/src/pages/admin/Dashboard.tsx": "Admin dashboard showing overview stats (users, blog posts, forum threads, tool usage) and management section cards for various admin functions. Protected by AdminAuthGuard.",
  "frontend/src/pages/admin/ForumModeration.tsx": "Admin page placeholder for forum moderation features, displaying a 'Coming Soon' message with navigation back to the admin dashboard.",
  "frontend/src/pages/admin/Login.tsx": "Admin login page with email/password form that uses the useAdminAuth hook for authentication and redirects to the admin dashboard on success.",
  "frontend/src/pages/admin/QuotaManagement.tsx": "Admin interface for configuring daily and weekly usage limits for each tool category, with editable table and reset functionality (frontend state only, backend integration pending).",
  "frontend/src/pages/admin/ResetUserStats.tsx": "Admin page placeholder for resetting user usage statistics, wrapped in AdminAuthGuard, displaying planned features and implementation details.",
  "frontend/src/pages/admin/ToolManagement.tsx": "Admin interface for adding and managing tool metadata definitions (name, slug, description, category, icon, tags) with form submission handling.",
  "frontend/src/pages/admin/ToolsDiagnostic.tsx": "Diagnostic dashboard that analyzes all tools for metadata completeness (icon, description, FAQs, about content) with filtering, sorting, and statistics display.",
  "frontend/src/pages/admin/UsageAnalytics.tsx": "Admin analytics dashboard placeholder showing overview stats cards and sections for popular tools and category usage, requiring backend integration for real data.",
  "frontend/src/pages/admin/UserManagement.tsx": "Admin page placeholder for user management features, wrapped in AdminAuthGuard with a \"Coming Soon\" card indicating future functionality for managing user accounts, roles, and permissions.",
  "frontend/src/pages/admin/UserStatistics.tsx": "Admin page placeholder for user statistics and analytics, wrapped in AdminAuthGuard with a \"Coming Soon\" card indicating future functionality for displaying user behavior and platform usage data.",
  "frontend/src/pages/BlogArticle.tsx": "Empty file placeholder for individual blog article page.",
  "frontend/src/pages/BlogIndex.tsx": "Empty file placeholder for blog listing/index page.",
  "frontend/src/pages/CategoryPage.tsx": "Displays tools filtered by category with a hero section, breadcrumbs, featured tools, tool grid, and sidebar. Handles category not found cases.",
  "frontend/src/pages/ContactUs.tsx": "Contact page with hero section, contact cards (email, phone, WhatsApp), and a form for submitting messages with simulated submission handling.",
  "frontend/src/pages/Dashboard.tsx": "User dashboard showing profile, credit balance, usage statistics, and favorite tools. Requires authentication and displays loading states while fetching data.",
  "frontend/src/pages/docs/CanisterDeployment.tsx": "Documentation page explaining how to deploy Internet Computer canisters to local replica and mainnet, covering deployment commands, upgrade modes, cycle management, and accessing deployed applications with step-by-step instructions.",
  "frontend/src/pages/docs/DocsIndex.tsx": "Documentation index page providing navigation to 15+ documentation sections including project specification, technical architecture, development guidelines, features, tools catalog, IC platform setup, authentication, and deployment guides.",
  "frontend/src/pages/docs/DynamicPages.tsx": "Documentation page detailing all dynamic pages (Homepage, Category pages, Tool pages, Dashboard, Admin pages) with component hierarchy diagrams, architecture explanations, and data flow patterns.",
  "frontend/src/pages/docs/FrontendBackendIntegration.tsx": "Documentation page explaining how to connect React frontend to Motoko backend using TypeScript declarations, useActor hook, React Query integration, and authenticated canister calls with architecture diagrams showing data flow and caching strategies.",
  "frontend/src/pages/docs/IcPlatformSetup.tsx": "Documentation page providing a complete guide to installing DFX SDK, initializing Internet Computer projects, configuring canisters, and deploying to local replica with step-by-step terminal commands and prerequisites.",
  "frontend/src/pages/docs/InternetIdentityAuth.tsx": "Documentation page explaining Internet Identity authentication integration, including AuthClient setup, useInternetIdentity hook usage, login/logout flows, protected routes, and a visual authentication flow diagram.",
  "frontend/src/pages/docs/MotokoBackendPatterns.tsx": "Documentation page covering Motoko backend development patterns including stable variables for state persistence, async patterns, authorization, error handling, query optimization, and actor lifecycle management with upgrade processes.",
  "frontend/src/pages/docs/ProjectSpecification.tsx": "Project specification page listing all 70+ tools organized into 16 categories (Calculators, Converters, Generators, etc.), static pages with their routes and components, and overall platform structure.",
  "frontend/src/pages/docs/ProjectStructureGuide.tsx": "Technical architecture documentation covering the single-actor Motoko backend pattern, stable variables for data persistence, frontend directory organization, file paths, and component structure.",
  "frontend/src/pages/docs/StaticPagesContent.tsx": "Documentation of all static pages including About Us, Contact Us, and legal pages (Terms of Service, Privacy Policy, Cookie Policy, Data Rights) with implementation details, content guidelines, and page structure examples.",
  "frontend/src/pages/docs/TechnologyStack.tsx": "Documentation page that provides a comprehensive overview of the technology stack used in the Worldsathi Tools Portal, including Motoko backend, React frontend, Tailwind CSS, Shadcn UI, React Query, Three.js, and Internet Identity with architecture diagrams and integration patterns.",
  "frontend/src/pages/docs/ToolArchitectureReference.tsx": "Technical reference documentation page detailing tool file structure, naming conventions, TypeScript interfaces, and ToolPageTemplate component usage patterns for developers creating new tools in the platform.",
  "frontend/src/pages/docs/ToolCreationTutorial.tsx": "Step-by-step tutorial page for beginner developers that guides through the complete workflow of creating and integrating new tools, from planning and design through implementation and deployment with visual workflow diagrams.",
  "frontend/src/pages/docs/ToolExamples.tsx": "Documentation page showcasing complete, annotated code examples of different tool types (calculators, converters, etc.) with expandable sections showing both component implementation and metadata registration patterns.",
  "frontend/src/pages/docs/ToolIntegrationChecklist.tsx": "Interactive checklist page with checkboxes that guides developers through the step-by-step verification process of properly integrating a new tool into the platform, covering metadata registration, routing, and visibility requirements.",
  "frontend/src/pages/docs/TroubleshootingGuide.tsx": "React component displaying a troubleshooting guide for Internet Computer development issues, including CORS errors, identity delegation problems, actor creation failures, and deployment issues with code examples and solutions.",
  "frontend/src/pages/forum/CreateThread.tsx": "Empty file for forum thread creation functionality.",
  "frontend/src/pages/forum/ForumIndex.tsx": "Empty file for forum index/listing page.",
  "frontend/src/pages/forum/ForumThread.tsx": "Empty file for individual forum thread display.",
  "frontend/src/pages/HomePage.tsx": "Main landing page with hero section, search functionality with live filtering, featured tools grid, category cards, popular tools by category, new tools section, trust signals, and sidebar.",
  "frontend/src/pages/legal/CookiePolicy.tsx": "React component displaying the cookie policy page, explaining the use of LocalStorage for authentication, theme preferences, and usage limits, with no third-party tracking cookies.",
  "frontend/src/pages/legal/DataRights.tsx": "React component providing GDPR/CCPA data rights interface with forms for users to request data export or account deletion, including status feedback.",
  "frontend/src/pages/legal/LegalPage.tsx": "React component displaying a legal hub page with cards linking to Terms of Service, Privacy Policy, Cookie Policy, and Data Rights pages (all marked as coming soon).",
  "frontend/src/pages/legal/PrivacyPolicy.tsx": "React component displaying the privacy policy page, covering data collection (account info, usage data, local storage), data usage, retention, security, and user rights under GDPR/CCPA.",
  "frontend/src/pages/legal/TermsOfService.tsx": "React component displaying the terms of service page, covering acceptable use, account responsibilities, free/premium tiers, content conduct, intellectual property, warranties, and liability disclaimers.",
  "frontend/src/pages/tools/Analyzer1.tsx": "Text analyzer tool that counts characters, words, sentences, and paragraphs in user-provided text. Displays results in a grid layout with stats cards.",
  "frontend/src/pages/tools/Analyzer2.tsx": "Empty file with no content.",
  "frontend/src/pages/tools/analyzers/ColorAccessibilityChecker.tsx": "Color accessibility checker that calculates WCAG contrast ratios between foreground and background colors, validates AA/AAA compliance levels for normal and large text, and suggests better color combinations.",
  "frontend/src/pages/tools/analyzers/ColorPaletteExtractor.tsx": "React component that extracts and displays the top 8 dominant colors from an uploaded image using canvas pixel sampling and color quantization, with copy-to-clipboard and export functionality.",
  "frontend/src/pages/tools/analyzers/ReadabilityAnalyzer.tsx": "React component that analyzes text readability using Flesch Reading Ease and Flesch-Kincaid Grade Level formulas, providing scores and difficulty ratings based on syllable and sentence structure.",
  "frontend/src/pages/tools/analyzers/TextAnalyzer.tsx": "React component that provides real-time text analysis metrics including character/word/sentence counts, reading time estimation, average word length, and longest word detection.",
  "frontend/src/pages/tools/Calculator1.tsx": "Percentage calculator tool that computes a percentage of a given value. Displays the result with a formatted explanation.",
  "frontend/src/pages/tools/Calculator2.tsx": "Empty file with no content.",
  "frontend/src/pages/tools/Calculator3.tsx": "BMI calculator supporting metric and imperial units that computes body mass index and categorizes results (underweight, normal, overweight, obese) with color-coded output.",
  "frontend/src/pages/tools/Calculator4.tsx": "Tip calculator with preset tip percentages (15%, 18%, 20%, 25%) that calculates tip amount, total bill, and per-person split for groups.",
  "frontend/src/pages/tools/Calculator5.tsx": "Loan calculator that computes monthly payment, total payment, and total interest using the standard loan amortization formula based on principal, interest rate, and term.",
  "frontend/src/pages/tools/Calculator6.tsx": "Compound interest calculator with configurable compounding frequency (annually to daily) that calculates final amount and interest earned using the compound interest formula.",
  "frontend/src/pages/tools/Calculator7.tsx": "Calorie calculator tool that computes daily calorie needs using the Mifflin-St Jeor equation based on age, gender, weight, height, and activity level, providing maintenance, weight loss, and weight gain targets.",
  "frontend/src/pages/tools/calculators/AgeCalculator.tsx": "React component that calculates age in years, months, and days from a birth date, and displays next birthday information and countdown.",
  "frontend/src/pages/tools/calculators/DateCalculator.tsx": "React component that performs date operations including calculating differences between two dates or adding/subtracting days from a given date.",
  "frontend/src/pages/tools/calculators/DiscountCalculator.tsx": "React component for calculating discounts with real-time validation, showing discount amount, final price, and savings with currency formatting and error handling.",
  "frontend/src/pages/tools/calculators/PercentageChangeCalculator.tsx": "React component that calculates percentage change between initial and final values, displaying absolute difference and percentage increase/decrease with visual indicators.",
  "frontend/src/pages/tools/calculators/StandardDeviationCalculator.tsx": "React component for calculating standard deviation and variance from comma or line-separated number datasets, with input validation and statistical results display.",
  "frontend/src/pages/tools/Converter1.tsx": "Unit converter tool for length measurements (meters, feet, inches, kilometers, miles) with conversion logic based on meter as the base unit.",
  "frontend/src/pages/tools/Converter2.tsx": "Currency converter tool supporting USD, EUR, GBP, JPY, CAD, and AUD with hardcoded exchange rates relative to USD.",
  "frontend/src/pages/tools/Converter3.tsx": "Temperature converter tool that converts between Celsius, Fahrenheit, and Kelvin using Celsius as the intermediate conversion unit.",
  "frontend/src/pages/tools/Converter4.tsx": "Timezone converter tool that converts date/time between multiple timezones using JavaScript's native Intl API with automatic daylight saving time handling.",
  "frontend/src/pages/tools/Converter5.tsx": "Weight converter tool that converts between kilograms, pounds, ounces, grams, and metric tons using conversion rates relative to kilograms as the base unit.",
  "frontend/src/pages/tools/converters/AreaConverter.tsx": "React component for converting between area units (square meters, feet, acres, hectares, kilometers) with bidirectional conversion and unit swapping functionality.",
  "frontend/src/pages/tools/converters/CurrencyConverter.tsx": "React component for converting between 10 major currencies using hardcoded exchange rates relative to USD, with real-time conversion and currency swap functionality.",
  "frontend/src/pages/tools/converters/NumberBaseConverter.tsx": "React component for converting numbers between different bases (binary, octal, decimal, hexadecimal) with input validation and error handling.",
  "frontend/src/pages/tools/converters/SpeedConverter.tsx": "React component for converting speed values between different units (km/h, mph, m/s, knots, ft/s) using predefined conversion rates.",
  "frontend/src/pages/tools/converters/TemperatureConverter.tsx": "React component for converting temperatures between Celsius, Fahrenheit, and Kelvin with real-time conversion, formula display, and unit swapping functionality.",
  "frontend/src/pages/tools/data-tools/CsvPivotTableGenerator.tsx": "React component for parsing CSV files and generating pivot tables with configurable row/column dimensions, value fields, and aggregation functions (sum, average, count, min, max).",
  "frontend/src/pages/tools/data-tools/JsonToXmlConverter.tsx": "React component for converting JSON data to XML format with support for nested objects, arrays, and XML attributes through a recursive conversion algorithm.",
  "frontend/src/pages/tools/data-tools/SqlFormatter.tsx": "React component for formatting SQL queries with keyword capitalization, indentation, and newline insertion. Provides input/output textareas, copy functionality, and FAQ section for SQL formatting.",
  "frontend/src/pages/tools/Data1.tsx": "JSON formatter tool that provides format, minify, and validate operations for JSON data with error handling and copy-to-clipboard functionality.",
  "frontend/src/pages/tools/Data2.tsx": "CSV to JSON converter that parses CSV data with configurable delimiters and optional header row, outputting formatted JSON arrays or objects.",
  "frontend/src/pages/tools/Data3.tsx": "Base64 encoding/decoding tool that converts between plain text and Base64 format using browser's btoa/atob functions with error handling.",
  "frontend/src/pages/tools/developer-tools/BcryptGenerator.tsx": "React component for generating bcrypt password hashes with configurable salt rounds (4-12). Includes client-side mock hashing with security warnings and copy-to-clipboard functionality.",
  "frontend/src/pages/tools/developer-tools/ColorCodeConverter.tsx": "React component that converts HEX color codes to RGB, HSL, and OKLCH formats. Features color preview, copy functionality for each format, and reset capability.",
  "frontend/src/pages/tools/developer-tools/FaviconGenerator.tsx": "React component that generates favicons in multiple sizes (16x16, 32x32, 64x64) from text or emoji input. Uses HTML canvas to render and provides download functionality for each size.",
  "frontend/src/pages/tools/developer-tools/HashGenerator.tsx": "React component that generates cryptographic hashes (MD5, SHA-1, SHA-256, SHA-384, SHA-512) from text input using Web Crypto API. Includes copy-to-clipboard and auto-generation on text change.",
  "frontend/src/pages/tools/developer-tools/JsonToTypescript.tsx": "React component that converts JSON input to TypeScript interfaces, with type inference for nested objects and arrays, and copy-to-clipboard functionality.",
  "frontend/src/pages/tools/developer-tools/JwtDecoder.tsx": "React component that decodes JWT tokens into header, payload, and signature sections with copy functionality, performing client-side base64 decoding without signature verification.",
  "frontend/src/pages/tools/developer-tools/LoremIpsumCode.tsx": "React component that generates Lorem Ipsum placeholder text formatted as code arrays in JavaScript, Python, and JSON formats with configurable paragraph count.",
  "frontend/src/pages/tools/developer-tools/SecureRandomString.tsx": "React component that generates cryptographically secure random strings using Web Crypto API with configurable length and character sets (uppercase, lowercase, numbers, symbols).",
  "frontend/src/pages/tools/developer-tools/UuidValidator.tsx": "React component that validates UUID/GUID format, detects version, and displays component breakdown (time-low, time-mid, clock-seq, node) for valid UUIDs.",
  "frontend/src/pages/tools/Developer1.tsx": "Regular expression tester that validates regex patterns against test strings with configurable flags (global, case-insensitive, multiline) and displays all matches.",
  "frontend/src/pages/tools/Developer2.tsx": "Hash generator tool page that creates SHA-1, SHA-256, SHA-384, and SHA-512 hashes from user input using the Web Crypto API. Includes copy functionality, FAQs, and related tools display.",
  "frontend/src/pages/tools/Developer3.tsx": "URL encoder/decoder tool page that converts URLs between encoded and decoded formats using encodeURIComponent/decodeURIComponent. Features mode toggle, copy functionality, and FAQs about URL encoding.",
  "frontend/src/pages/tools/finance-tools/MortgageCalculator.tsx": "React component that calculates monthly mortgage payments, total payment, and total interest using the standard amortization formula based on principal, interest rate, and loan term inputs.",
  "frontend/src/pages/tools/Generator1.tsx": "Password generator tool page with customizable length and character type options (uppercase, lowercase, numbers, symbols). Generates cryptographically secure passwords locally in the browser.",
  "frontend/src/pages/tools/Generator2.tsx": "QR code generator tool page that creates QR codes from text or URLs using an external API (qrserver.com). Includes download functionality and reset option.",
  "frontend/src/pages/tools/Generator3.tsx": "Lorem Ipsum generator tool page that creates placeholder text in paragraphs, words, or characters. Generates randomized Latin-based text with copy functionality.",
  "frontend/src/pages/tools/Generator4.tsx": "UUID/GUID generator tool page that creates batch UUIDs (v4) with configurable quantity (1-100). Features individual and bulk copy functionality for generated identifiers.",
  "frontend/src/pages/tools/Generator5.tsx": "Color palette generator tool that creates 5 random hex colors with RGB conversion, copy-to-clipboard functionality, and displays colors with visual swatches.",
  "frontend/src/pages/tools/generators/BarcodeGenerator.tsx": "React component for generating barcodes in CODE128, EAN13, and UPC formats with canvas-based rendering, validation, and PNG download functionality.",
  "frontend/src/pages/tools/generators/GradientArtStudio.tsx": "React component for creating multi-layer gradient compositions with linear/radial/conic types, blend modes, opacity controls, and CSS/PNG export capabilities.",
  "frontend/src/pages/tools/generators/GradientPatternGenerator.tsx": "React component for generating gradients with multiple color stops and optional pattern overlays (dots/lines/grid), rendered on canvas with customizable angles and types.",
  "frontend/src/pages/tools/generators/MarkdownTableGenerator.tsx": "React component for creating and editing Markdown tables with dynamic rows/columns, alignment controls, and export to Markdown or CSV formats.",
  "frontend/src/pages/tools/generators/MeshGradientCreator.tsx": "React component for creating mesh gradients using a customizable grid of color points with radial blending, smoothness controls, and CSS/PNG export options.",
  "frontend/src/pages/tools/generators/SvgPatternDesigner.tsx": "React component for designing and generating customizable SVG patterns (dots, lines, waves, hexagons, triangles) with adjustable colors, scale, spacing, and rotation. Includes copy-to-clipboard and download functionality.",
  "frontend/src/pages/tools/generators/UsernameGenerator.tsx": "React component that generates random usernames by combining adjectives and nouns with optional numbers in various styles (camelCase, snake_case, lowercase). Features copy-to-clipboard functionality for generated usernames.",
  "frontend/src/pages/tools/image-tools/DuotoneImageFilter.tsx": "React component for applying duotone color effects to uploaded images using canvas manipulation. Allows customization of shadow/highlight colors, intensity, blend modes, and includes before/after comparison.",
  "frontend/src/pages/tools/image-tools/ImageMetadataStripper.tsx": "React component that removes EXIF metadata from images for privacy protection. Displays extracted metadata (camera, GPS, date) and generates cleaned images via canvas re-rendering with download capability.",
  "frontend/src/pages/tools/Image1.tsx": "Image resizer tool that allows users to upload images, adjust dimensions with optional aspect ratio locking, and download resized images processed entirely in the browser.",
  "frontend/src/pages/tools/Image2.tsx": "Image compressor tool that reduces file size by converting images to JPEG with adjustable quality settings, showing original vs compressed size comparison.",
  "frontend/src/pages/tools/Image3.tsx": "Image format converter that transforms images between PNG, JPEG, and WebP formats with quality control, processing entirely client-side.",
  "frontend/src/pages/tools/ImageCropper.tsx": "Image cropping tool with preset aspect ratios (1:1, 4:3, 16:9, free) and custom pixel dimensions, performing center-crop operations on canvas.",
  "frontend/src/pages/tools/ImageFilter.tsx": "Image filter tool applying adjustable brightness, contrast, blur, grayscale, and sepia effects using canvas manipulation, with reset and download capabilities.",
  "frontend/src/pages/tools/ImageRotator.tsx": "React component for rotating images by preset angles (90°, 180°, 270°) or custom degrees using HTML5 canvas. Includes upload, preview, rotation controls, and download functionality.",
  "frontend/src/pages/tools/ImageToBase64.tsx": "React component that converts uploaded images to Base64-encoded strings. Displays image preview, file size, and provides copy-to-clipboard functionality for the Base64 output.",
  "frontend/src/pages/tools/ImageWatermark.tsx": "React component for adding text watermarks to images with customizable position, opacity, and font size. Uses canvas to render watermarks with white text and black outline.",
  "frontend/src/pages/tools/Productivity1.tsx": "Pomodoro timer React component with customizable work/break durations and cycle counts. Features play/pause/reset controls and automatic transitions between work sessions and breaks.",
  "frontend/src/pages/tools/Productivity2.tsx": "Empty file with no content.",
  "frontend/src/pages/tools/seo-tools/RobotsTxtGenerator.tsx": "React component for generating robots.txt files with configurable user-agent rules, crawl delays, and sitemap URLs. Includes presets (allow-all, disallow-all, standard) and copy/download functionality.",
  "frontend/src/pages/tools/Seo1.tsx": "Meta tags generator React component that creates HTML meta tags for SEO and social media (Open Graph, Twitter Card). Includes form inputs and copy-to-clipboard functionality for generated tags.",
  "frontend/src/pages/tools/Seo2.tsx": "Keyword Density Checker tool that analyzes text to calculate the frequency and percentage of keywords (words longer than 3 characters), displaying the top 20 results in a sortable table.",
  "frontend/src/pages/tools/Seo3.tsx": "Open Graph Preview tool that generates and previews social media meta tags (Open Graph and Twitter Card) based on user-provided URL, title, description, and image inputs.",
  "frontend/src/pages/tools/text-tools/CaseConverter.tsx": "React component that converts input text to multiple case formats (uppercase, lowercase, title case, sentence case, alternating case) with individual copy-to-clipboard buttons for each conversion.",
  "frontend/src/pages/tools/text-tools/CharacterCounter.tsx": "React component that counts and displays text statistics (characters with/without spaces, words, sentences, paragraphs, lines) with copy and reset functionality.",
  "frontend/src/pages/tools/text-tools/RemoveDuplicateLines.tsx": "React component that removes duplicate lines from text input with case-sensitive/insensitive matching option and displays statistics about removed duplicates.",
  "frontend/src/pages/tools/text-tools/TextDiffChecker.tsx": "React component that compares two text inputs line-by-line and highlights added, removed, and unchanged lines with visual diff display.",
  "frontend/src/pages/tools/text-tools/TextReverser.tsx": "React component that reverses text either character-by-character or word-by-word with mode selection and copy functionality.",
  "frontend/src/pages/tools/ToolPageTemplate.tsx": "Reusable template component for tool pages that provides consistent layout with hero section, breadcrumbs, main tool interface, usage guide, FAQs, testimonials, performance metrics, API info, and related tools sidebar.",
  "frontend/src/pages/tools/XmlToJsonConverter.tsx": "XML to JSON converter tool that parses XML input using DOMParser, recursively converts it to JSON format handling elements, attributes, and nested structures, with copy-to-clipboard functionality.",
  "frontend/src/types/blog.ts": "Empty TypeScript file for blog-related type definitions.",
  "frontend/src/types/tools.ts": "TypeScript type definitions for tool metadata including categories, filters, FAQs, testimonials, performance metrics, and API information.",
  "frontend/src/utils/breadcrumbHelpers.ts": "Utility function that generates breadcrumb navigation items from URL pathname for categories, tools, dashboard, and admin pages.",
  "frontend/src/utils/formatters.ts": "Collection of formatting utilities for dates, numbers, currency, file sizes, text truncation, and reading time calculation.",
  "frontend/src/utils/toolHelpers.ts": "Utility functions for filtering, sorting, and finding related tools based on search queries, categories, tags, and similarity scoring. Includes functions to get tool paths and handle both tool objects and IDs.",
  "frontend/src/utils/urlParams.ts": "URL parameter parsing utilities that work with both query strings and hash-based routing, including sessionStorage persistence for parameters like admin tokens and functions to clear sensitive data from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including HSL-based color system, custom animations, typography plugin, and design tokens for borders, shadows, and font families.",
  "project_state.json": "Project state metadata defining an AI tools platform with comprehensive documentation system, tracking existing features for static/dynamic pages, technology stack documentation, and architectural diagrams."
}